app/Http/Controllers/ElrelController.php

    public function index()
    {
        $users = User::all();
        // lazy loading
        // $posts = Post::all();
        // eager loading
        $posts = Post::with('user')->get();
        $roles = Role::all();
        $countries = Country::all();
        $photos = Photo::all();
        $videos = Video::all();
        $tags = Tag::all();
---
select * from `users`
select * from `posts` where `posts`.`deleted_at` is null
select * from `users` where `users`.`id` in ('1', '2')
select * from `roles`
select * from `countries`
select * from `photos`
select * from `videos`
select * from `tags`