app/Http/Controllers/HomeController.php

    public function index()
    {
        $users = User::all();
---
select * from `users`

    public function deleteuser($user_id)
    {
        $user = User::find($user_id);
        $user->address()->delete();
        $user->delete();
---
select * from `users` where `users`.`id` = '2' limit 1
delete from `addresses` where `addresses`.`user_id` = '2' and `addresses`.`user_id` is not null
delete from `users` where `id` = '2'

    public function userdetail($user_id)
    {
        $user = User::find($user_id);
---
select * from `users` where `users`.`id` = '6' limit 1

    public function createaddress($user_id)
    {
        $address = new Address(['name' => 'This is some address']);

        $user = User::find($user_id);

        $user->address()->save($address);
---
select * from `users` where `users`.`id` = '1' limit 1
insert into `addresses` (`name`, `user_id`, `updated_at`, `created_at`) values ('This is some address', '6', '2017-09-19 03:53:28', '2017-09-19 03:53:28')

    public function deleteaddress($user_id)
    {
        $user = User::find($user_id);

        $user->address()->delete();
---
select * from `users` where `users`.`id` = '3' limit 1
delete from `addresses` where `addresses`.`user_id` = '1' and `addresses`.`user_id` is not null

    public function updateaddress($address_id)
    {
        $address = Address::find($address_id);
        $address->name = 'Updated address';
        $address->save();
---
select * from `addresses` where `addresses`.`id` = '8' limit 1
update `addresses` set `name` = 'Updated address', `updated_at` = '2017-09-19 03:21:25' where `id` = '8'